spec/support/vcr_cassettes/mvi/find_candidate/historical_icns_with_traits.yml

---
http_interactions:
- request:
    method: post
    uri: "<MVI_URL>"
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTVlODE5ZDE3LWNlOWItNDg2MC05MjllLWY5MDYyODM2ZWJk
        MCIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE4MDIyMTIwMTkw
        MSIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iMy4wIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8ZGF0YUVudGVyZXIgdHlw
        ZUNvZGU9IkVOVCIgY29udGV4dENvbnRyb2xDb2RlPSJBUCI+CiAgICAgICAg
        ICA8YXNzaWduZWRQZXJzb24gY2xhc3NDb2RlPSJBU1NJR05FRCI+CiAgICAg
        ICAgICAgIDxpZCBleHRlbnNpb249Ijc2ODU5ODU3NCIgcm9vdD0iMi4xNi44
        NDAuMS4xMTM4ODMuNzc3Ljk5OSIvPgogICAgICAgICAgICA8YXNzaWduZWRQ
        ZXJzb24gY2xhc3NDb2RlPSJQU04iIGRldGVybWluZXJDb2RlPSJJTlNUQU5D
        RSI+CiAgICAgICAgICAgICAgPG5hbWU+CiAgICAgICAgICAgICAgICA8Z2l2
        ZW4+UkZJUlNUPC9naXZlbj4KICAgICAgICAgICAgICAgIDxmYW1pbHk+UkxB
        U1Q8L2ZhbWlseT4KICAgICAgICAgICAgICA8L25hbWU+CiAgICAgICAgICAg
        IDwvYXNzaWduZWRQZXJzb24+CiAgICAgICAgICA8L2Fzc2lnbmVkUGVyc29u
        PgogICAgICAgIDwvZGF0YUVudGVyZXI+CiAgICAgICAgPHF1ZXJ5QnlQYXJh
        bWV0ZXI+CiAgICAgICAgICA8cXVlcnlJZCByb290PSIxLjIuODQwLjExNDM1
        MC4xLjEzLjI4LjEuMTguNS45OTkiIGV4dGVuc2lvbj0iMTgyMDQiLz4KICAg
        ICAgICAgIDxzdGF0dXNDb2RlIGNvZGU9Im5ldyIvPgogICAgICAgICAgPG1v
        ZGlmeUNvZGUgY29kZT0iTVZJLkNPTVAyIi8+CiAgICAgICAgICA8aW5pdGlh
        bFF1YW50aXR5IHZhbHVlPSIxIi8+CiAgICAgICAgICA8cGFyYW1ldGVyTGlz
        dD4KICAgICAgICAgICAgPGxpdmluZ1N1YmplY3RBZG1pbmlzdHJhdGl2ZUdl
        bmRlcj4KICAgICAgICAgICAgICA8dmFsdWUgY29kZT0iTSIvPgogICAgICAg
        ICAgICAgIDxzZW1hbnRpY3NUZXh0PkdlbmRlcjwvc2VtYW50aWNzVGV4dD4K
        ICAgICAgICAgICAgPC9saXZpbmdTdWJqZWN0QWRtaW5pc3RyYXRpdmVHZW5k
        ZXI+CiAgICAgICAgICAgIDxsaXZpbmdTdWJqZWN0QmlydGhUaW1lPgogICAg
        ICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iMTk3OTA4MTIiLz4KICAgICAgICAg
        ICAgICA8c2VtYW50aWNzVGV4dD5EYXRlIG9mIEJpcnRoPC9zZW1hbnRpY3NU
        ZXh0PgogICAgICAgICAgICA8L2xpdmluZ1N1YmplY3RCaXJ0aFRpbWU+CiAg
        ICAgICAgICAgIDxsaXZpbmdTdWJqZWN0SWQ+CiAgICAgICAgICAgICAgPHZh
        bHVlIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjQuMSIgZXh0ZW5zaW9uPSI3
        Njg1OTg1NzQiLz4KICAgICAgICAgICAgICA8c2VtYW50aWNzVGV4dD5TU048
        L3NlbWFudGljc1RleHQ+CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVjdElk
        PgogICAgICAgICAgICA8bGl2aW5nU3ViamVjdE5hbWU+CiAgICAgICAgICAg
        ICAgPHZhbHVlIHVzZT0iTCI+CiAgICAgICAgICAgICAgICA8Z2l2ZW4+UkZJ
        UlNUPC9naXZlbj4KICAgICAgICAgICAgICAgIDxmYW1pbHk+UkxBU1Q8L2Zh
        bWlseT4KICAgICAgICAgICAgICA8L3ZhbHVlPgogICAgICAgICAgICAgIDxz
        ZW1hbnRpY3NUZXh0PkxlZ2FsIE5hbWU8L3NlbWFudGljc1RleHQ+CiAgICAg
        ICAgICAgIDwvbGl2aW5nU3ViamVjdE5hbWU+CiAgICAgICAgICA8L3BhcmFt
        ZXRlckxpc3Q+CiAgICAgICAgPC9xdWVyeUJ5UGFyYW1ldGVyPgogICAgICA8
        L2NvbnRyb2xBY3RQcm9jZXNzPgogICAgPC9pZG06UFJQQV9JTjIwMTMwNVVW
        MDI+CiAgPC9lbnY6Qm9keT4KPC9lbnY6RW52ZWxvcGU+Cg==
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Wed, 21 Feb 2018 20:19:01 GMT
      Content-Length:
      - '3049'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Wed, 21 Feb 2018 20:15:50 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=QjZQhNTWPQnrwxQvmbRDJ9JGz2xGBkS9chhhw5xwfyTHNPnTXhYS!232188642;
        path=/; HttpOnly
      X-Powered-By:
      - Servlet/2.5 JSP/2.1
      X-Global-Transaction-Id:
      - 659f2fcc5a8dd4355930b2a1
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><env:Header/><env:Body><idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns="urn:hl7-org:v3"><id extension="WSDOC1802211415506491069482197" root="2.16.840.1.113883.4.349"/><creationTime value="20180221141550"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M" root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id extension="200VGOV-5e819d17-ce9b-4860-929e-f9062836ebd0" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><subject typeCode="SUBJ"><registrationEvent classCode="REG" moodCode="EVN"><id nullFlavor="NA"/><statusCode code="active"/><subject1 typeCode="SBJ"><patient classCode="PAT"><id extension="1008787551V609092^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/><id extension="768598574^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/><id extension="0000001008787551V609092000000^PI^200ESR^USVHA^A" root="2.16.840.1.113883.4.349"/><id extension="1000^PI^200VETS^USDVA^A" root="2.16.840.1.113883.4.349"/><id extension="201801104^PI^523^USVHA^A" root="2.16.840.1.113883.4.349"/><id extension="22710152^PI^585^USVHA^A" root="2.16.840.1.113883.4.349"/><id extension="2011801312^PI^200VETS^USDVA^A" root="2.16.840.1.113883.4.349"/><id extension="32364231^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/><statusCode code="active"/><patientPerson><name use="L"><given>RFIRST</given><family>RLAST</family></name><administrativeGenderCode code="M"/><birthTime value="19790812"/><addr use="PHYS"><streetAddressLine>543 MAIN STREET</streetAddressLine><city>ASHBURN</city><state>VA</state><postalCode>20148</postalCode><country>USA</country></addr><asOtherIDs classCode="SSN"><id extension="768598574" root="2.16.840.1.113883.4.1"/><scopingOrganization determinerCode="INSTANCE" classCode="ORG"><id root="1.2.840.114350.1.13.99997.2.3412"/></scopingOrganization></asOtherIDs></patientPerson><subjectOf1><queryMatchObservation classCode="COND" moodCode="EVN"><code code="IHE_PDQ"/><value value="167" xsi:type="INT"/></queryMatchObservation></subjectOf1></patient></subject1><custodian typeCode="CST"><assignedEntity classCode="ASSIGNED"><id root="2.16.840.1.113883.4.349"/></assignedEntity></custodian><replacementOf typeCode="RPLC"><priorRegistration classCode="REG" moodCode="EVN"><id extension="1008692852V724999^NI^200M^USVHA^D" root="2.16.840.1.113883.4.349"/><id extension="1008787485V229771^NI^200M^USVHA^D" root="2.16.840.1.113883.4.349"/></priorRegistration></replacementOf></registrationEvent></subject><queryAck><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="OK"/><resultCurrentQuantity value="1"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode code="new"/><modifyCode code="MVI.COMP2"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value code="M"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value value="19790812"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value extension="768598574" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value use="L"><given>RFIRST</given><family>RLAST</family></value><semanticsText>Legal Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
    http_version: 
  recorded_at: Wed, 21 Feb 2018 20:19:02 GMT
recorded_with: VCR 3.0.3
